Configuration/Диплом/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Configuration/Диплом/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент) 
	
	ТекущиеДанныеТаблицы=Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	ТекущиеДанныеТаблицы.Длительность = (НачалоДня(ТекущиеДанныеТаблицы.ДатаОкончания)-НачалоДня(ТекущиеДанныеТаблицы.ДатаНачала)) / (60 * 60 * 24)+1;
	ДлительностьВсегоСтруктура = ОтпускаСотрудниковПриИзмененииНаСервере(ТекущиеДанныеТаблицы.Сотрудник);
	
	Для Каждого Элемент из ДлительностьВсегоСтруктура.МассивИндексов Цикл
		Объект.ОтпускаСотрудников[Элемент-1].ДлительностьВсего =  ДлительностьВсегоСтруктура.ДлительностьВсего;
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы   

&НаКлиенте
Процедура АнализГрафика(Команда)
	   
	ТабличнаяЧастьВХ = ПоместитьВоВременноеХранилищеНаСервере();	
	//ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);          
	
	ПараметрыФормы=Новый Структура;
    ПараметрыФормы.Вставить("Год", Объект.Год);
    ПараметрыФормы.Вставить("ТабличнаяЧастьВХ", ТабличнаяЧастьВХ);
	
	//ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);          
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);          
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции   

&НаСервере
Функция ОтпускаСотрудниковПриИзмененииНаСервере(Сотрудник)
	Отбор = Новый Структура;
	Отбор.Вставить("Сотрудник", Сотрудник);
	Массив = Объект.ОтпускаСотрудников.НайтиСтроки(Отбор);    
	ДлительностьВсего = 0; 
	
	МассивИндексов = Новый Массив;
	
	Для Каждого Элемент из Массив Цикл    
		ДлительностьВсего = ДлительностьВсего + Элемент.Длительность;
		МассивИндексов.Добавить(Элемент.НомерСтроки);
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("МассивИндексов", МассивИндексов);
	Результат.Вставить("ДлительностьВсего", ДлительностьВсего);
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()
    Адрес = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(), УникальныйИдентификатор);
	Возврат Адрес; 
КонецФункции

#КонецОбласти
